# Відступи
OFFSET = 10             # можлива похибка при визначенні меж боксу слова (у пікселях)
ROW_HEIGHT = (68+2)     # типова висота рядку у пікселях (для крокування)
BLANK_MIN = 345         # межі значення номеру бланку по х
BLANK_MAX = 600         # межі значення номеру бланку по х
CREATED_MIN = 900       # межі значення дати видачі по х
CREATED_MAX = 1100      # межі значення дати видачі по х
EXPIRED_MIN = 1450      # початок значення "Дійсний до" по х
OFFICE_TIT_X = 183      # початок заголовку "Орган видачі" по х
OFFICE_VAL_X = 450      # початок значення "Орган видачі" по х
PERS_VALS_LOC = 525     # лінія розташування значень основних анкетних даних
PERS_TITL_LOC = 185     # лінія розташування значень основних анкетних даних
PLACE_X_LIM = 1500      # лінія закінчення пошуку адрес (далі артефакти фото анкети)

# Кольори
C_R = (0, 0, 255)       # червоний
C_G = (0, 200, 0)       # зелений
C_B = (255, 0, 0)       # синій
C_M = (255, 0, 255)     # фіолетовий
C_C = (255, 0, 255)     # блакитний
C_Y = (0, 200, 200)     # жовтий

# Зображення
DEF_COLOR = C_G         # колір за замовчуванням
TEXT_DEF_THICK = 1      # товщина шрифту
TEXT_DEF_SIZE = 0.6     # розмір шрифту
LINE_DEF_THICK = 2      # товщина основної лінії
DEF_RADIUS = 5          # радіус кола (відображення опорної точки боксів)
PAGE_H = 3368           # висота сторінки у пікселах (залежить від масштабування конвертації ПДФ - зображення)
PAGE_W = 2382           # ширина сторінки у пікселах (залежить від масштабування конвертації ПДФ - зображення)